24.
주어진 데이터(basic2.csv)에서 새로운 컬럼(1일 이전 시차 컬럼)을 만들고, Events가 1이면서 Sales가 1000000이하인 조건에 맞는 새로운 컬럼 합을 구하시오

In [1]:
import pandas as pd
df = pd.read_csv("./basic2.csv")
df

           Date     Sales      PV      UV  Events
0    2022-01-01  22711525  397349  4421.0       1
1    2022-01-02     36779    3969  2289.0       0
2    2022-01-03  13943875  373890     NaN       1
3    2022-01-04   8088593  142054  2157.0       0
4    2022-01-05   2395374  190684     NaN       0
..          ...       ...     ...     ...     ...
725  2023-12-27  33846609  415067  7360.0       1
726  2023-12-28   3659566  208601  2262.0       1
727  2023-12-29   1164008   14309   193.0       0
728  2023-12-30   3977696   60935     NaN       0
729  2023-12-31   3719764   60963  1507.0       0

[730 rows x 5 columns]

In [16]:
# shift 이용
df['new_pv'] = df['PV'].shift(1)
print(df[(df['Events']==1) & (df['Sales']<1000000)]['new_pv'].sum())

1894876.0

23. f1의 결측치를 채운 후 age 컬럼의 중복 제거 전과 후의 'f1' 중앙값 차이를 구하시오
- 결측치는 f1의 데이터 중 내림차순 정렬 후 10번째 값으로 채움
- 중복 데이터 발생시 뒤에 나오는 데이터를 삭제함
- 최종 결과값은 절대값으로 출력¶

In [51]:
import pandas as pd

df = pd.read_csv('./basic1.csv')
df

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [52]:
ten_value = float(df['f1'].sort_values(ascending = False)[10:11])
df['f1'].fillna(ten_value, inplace = True)
before_age = df['f1'].median()

df = df.drop_duplicates(['age'])
after_age = df['f1'].median()

print(abs(before_age - after_age))

0.5

22. 주어진 데이터(basic2.csv)에서 주 단위 Sales의 합계를 구하고, 가장 큰 값을 가진 주와 작은 값을 가진 주의 차이를 구하시오(절대값

In [60]:
import pandas as pd

df = pd.read_csv('./basic2.csv')
df

           Date     Sales      PV      UV  Events
0    2022-01-01  22711525  397349  4421.0       1
1    2022-01-02     36779    3969  2289.0       0
2    2022-01-03  13943875  373890     NaN       1
3    2022-01-04   8088593  142054  2157.0       0
4    2022-01-05   2395374  190684     NaN       0
..          ...       ...     ...     ...     ...
725  2023-12-27  33846609  415067  7360.0       1
726  2023-12-28   3659566  208601  2262.0       1
727  2023-12-29   1164008   14309   193.0       0
728  2023-12-30   3977696   60935     NaN       0
729  2023-12-31   3719764   60963  1507.0       0

[730 rows x 5 columns]

In [65]:
df['Date'] = pd.to_datetime(df['Date'])
df.index = df['Date']
df2 = df.resample('W').sum() # 이건 처음 알았네
print(abs(df2['Sales'].max() - df2['Sales'].min()))

91639050

21. 나이 구간 나누기

- basic1 데이터 중 'age'컬럼 이상치를 제거하고, 동일한 개수로 나이 순으로 3그룹으로 나눈 뒤 각 그룹의 중앙값을 더하시오
- (이상치는 음수(0포함), 소수점 값)

In [28]:
import pandas as pd

df = pd.read_csv('./basic1.csv')
df

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [29]:
df = df[df['age']>0]
df = df[(df['age'] == round(df['age'],0))]

age = df['age'].sort_values()
count = len(age)//3
print(age[0:count].median() + age[count:count*2].median() + age[count*2:count*3].median())

165.0

20. 고객과 잘 맞는 타입 추천 :)
- basic1 데이터 중 'f4'를 기준으로 basic3 데이터 'f4'값을 기준으로 병합하고,
- 병합한 데이터에서 r2결측치를 제거한다음, 앞에서 부터 20개 데이터를 선택하고 'f2'컬럼합을 구하시오
- basic1.csv: 고객 데이터
- basic3.csv: 잘 어울리는 관계 데이터 (추천1:r1, 추천2:r2)

In [8]:
import pandas as pd

df1 = pd.read_csv('./basic1.csv')
df2 = pd.read_csv('./basic3.csv')

print(df1.head())
print(df2.head())

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869
     f4    r1    r2
0  INFP  ENFJ  ENTJ
1  ENFP  INFJ   NaN
2  INFJ  ENFP  ENTP
3  ENFJ  INFP  ISFP
4  INTJ  ENFP  ENTP

In [24]:
merged_data = pd.merge(df1, df2, on = 'f4', how = 'left')
merged_data.dropna(subset = ['r2']).head(20)['f2'].sum()

15

19. 주어진 데이터에서 2022년 월별 Sales 합계 중 가장 큰 금액과 2023년 월별 Sales 합계 중 가장 큰 금액의 차이를 절대값으로 구하시오.
- 단 Events컬럼이 '1'인경우 80%의 Salse값만 반영함
- (최종값은 소수점 반올림 후 정수 출력)
- 데이터셋 : basic2.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [57]:
import pandas as pd

df = pd.read_csv('./basic2.csv')
df

           Date     Sales      PV      UV  Events
0    2022-01-01  22711525  397349  4421.0       1
1    2022-01-02     36779    3969  2289.0       0
2    2022-01-03  13943875  373890     NaN       1
3    2022-01-04   8088593  142054  2157.0       0
4    2022-01-05   2395374  190684     NaN       0
..          ...       ...     ...     ...     ...
725  2023-12-27  33846609  415067  7360.0       1
726  2023-12-28   3659566  208601  2262.0       1
727  2023-12-29   1164008   14309   193.0       0
728  2023-12-30   3977696   60935     NaN       0
729  2023-12-31   3719764   60963  1507.0       0

[730 rows x 5 columns]

In [58]:
df['Date'] = pd.to_datetime(df['Date'])
df['year'] = df['Date'].dt.year
df['month'] = df['Date'].dt.month

for i in range(len(df)):
    if df['Events'][i]==1:
        df['Sales'][i] = df['Sales'][i]*0.8

des = df.groupby(['year','month'])['Sales'].sum().to_frame().reset_index()
tt_ = des[des['year']==2022]['Sales'].max()
tt__ = des[des['year']==2023]['Sales'].max()

print(round(abs(tt__ - tt_)))

42473436

C:\Users\komsco\AppData\Local\Temp\ipykernel_4204\867285697.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Sales'][i] = df['Sales'][i]*0.8

18. 주어진 데이터에서 2022년 5월 주말과 평일의 sales컬럼 평균값 차이를 구하시오 (소수점 둘째자리까지 출력, 반올림)
- 데이터셋 : basic2.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [73]:
import pandas as pd

df = pd.read_csv('./basic2.csv')
df['Date'] = pd.to_datetime(df['Date'])
df['year'] = df['Date'].dt.year
df['month'] = df['Date'].dt.month
df['day'] = df['Date'].dt.day
df['dayofweek'] = df['Date'].dt.dayofweek
yn = []
for i in range(len(df)):
    if df['dayofweek'][i]>=5:
        yn.append(1)
    else:
        yn.append(0)
df['week'] = yn

df.index = df['Date']
one = df[(df['week']==1) & (df['year']==2022) & (df['month']==5)]['Sales'].mean()
two = df[(df['week']==0) & (df['year']==2022) & (df['month']==5)]['Sales'].mean()

print(round(abs(one - two),2))

3010339.1

17. 2022년 5월 sales의 중앙값을 구하시오.

In [1]:
import pandas as pd
df = pd.read_csv("./basic2.csv")
df

           Date     Sales      PV      UV  Events
0    2022-01-01  22711525  397349  4421.0       1
1    2022-01-02     36779    3969  2289.0       0
2    2022-01-03  13943875  373890     NaN       1
3    2022-01-04   8088593  142054  2157.0       0
4    2022-01-05   2395374  190684     NaN       0
..          ...       ...     ...     ...     ...
725  2023-12-27  33846609  415067  7360.0       1
726  2023-12-28   3659566  208601  2262.0       1
727  2023-12-29   1164008   14309   193.0       0
728  2023-12-30   3977696   60935     NaN       0
729  2023-12-31   3719764   60963  1507.0       0

[730 rows x 5 columns]

In [14]:
df['Date'] = pd.to_datetime(df['Date'])
df['year'] = df['Date'].dt.year
df['month'] = df['Date'].dt.month

df[(df['year']==2022) & (df['month']==5)]['Sales'].median()

1477685.0

16. 주어진 데이터 셋에서 f2가 0값인 데이터를 age를 기준으로 오름차순 정렬하고 앞에서 부터 20개의 데이터를 추출한 후 f1 결측치(최소값)를 채우기 전과 후의 분산 차이를 계산하시오 (소수점 둘째 자리까지)

- 데이터셋 : basic1.csv 
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작
- File -> Editor Type -> Script
 -->

In [102]:
import pandas as pd

df = pd.read_csv('./basic1.csv')
before = df[df['f2']==0].sort_values(by = ['age']).head(20)
before_var = before['f1'].var()
min_f1 = before['f1'].min()
after_var = before['f1'].fillna(min_f1).var()

print(round(abs(before_var - after_var),2))

38.44

15. 주어진 데이터 셋에서 age컬럼 상위 20개의 데이터를 구한 다음, f1의 결측치를 중앙값으로 채운다. 그리고 f4가 ISFJ와 f5가 20 이상인  f1의 평균값을 출력하시오!

- 데이터셋 : basic1.csv 
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작
- File -> Editor Type -> Script

In [110]:
import pandas as pd

df = pd.read_csv('./basic1.csv')
new_df = df.sort_values('age', ascending = False).head(20)
f1_median = new_df['f1'].median()

new_df['f1'] = new_df['f1'].fillna(f1_median)
print(round(new_df[(new_df['f4']=='ISFJ') & (new_df['f5']>=20)]['f1'].mean(),3))

73.875

14. city와 f4를 기준으로 f5의 평균값을 구한 다음, f5를 기준으로 상위 7개 값을 모두 더해 출력하시오 (소수점 둘째자리까지 출력)
- 데이터셋 : basic1.csv 
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작
- File -> Editor Type -> Script

In [118]:
import pandas as pd

df = pd.read_csv('./basic1.csv')
print(round(df.groupby(['city', 'f4'])['f5'].mean().to_frame().reset_index().sort_values('f5', ascending = False).head(7)['f5'].sum(),2))

643.68

13. 상관관계 구하기 주어진 데이터에서 상관관계를 구하고, quality와의 상관관계가 가장 큰 값과, 가장 작은 값을 구한 다음 더하시오!
- 단, quality와 quality 상관관계 제외, 소수점 둘째 자리까지 출력

- 데이터셋 : ../input/red-wine-quality-cortez-et-al-2009/winequality-red.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작
- 스크립트 방식 권장: File -> Editor Type -> Script

In [14]:
import pandas as pd

df = pd.read_csv('./winequality-red.csv')
cor_data = abs(df.corr()['quality'][:-1])
print(round(cor_data.max() + cor_data.min(),2))

0.49

12. 주어진 데이터에서 상위 10개 국가의 접종률 평균과 하위 10개 국가의 접종률 평균을 구하고, 그 차이를 구해보세요 
- (단, 100%가 넘는 접종률 제거, 소수 첫째자리까지 출력)

- 데이터셋 : ../input/covid-vaccination-vs-death/covid-vaccination-vs-death_ratio.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작
- File -> Editor Type -> Script

In [15]:
## 데이터를 못구했네..

11.주어진 데이터에서 'f5'컬럼을 min-max 스케일 변환한 후, 상위 5%와 하위 5% 값의 합을 구하시오

- 데이터셋 : basic1.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작
- File -> Editor Type -> Script

In [23]:
import pandas as pd
from sklearn.preprocessing import MinMaxScaler

sc = MinMaxScaler()
df = pd.read_csv('./basic1.csv')
df['f5'] = sc.fit_transform(df[['f5']])
print(df['f5'].quantile(0.95) + df['f5'].quantile(0.05))

1.0248740983597389

10. 수치형 변수 변환하기 주어진 데이터에서 20세 이상인 데이터를 추출하고 'f1'컬럼을 결측치를 최빈값으로 채운 후, f1 컬럼의 여-존슨과 박스콕스 변환 값을 구하고, 두 값의 차이를 절대값으로 구한다음 모두 더해 소수점 둘째 자리까지 출력(반올림)하시오
- 데이터셋 : basic1.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [37]:
import pandas as pd
from sklearn.preprocessing import power_transform

data = pd.read_csv('./basic1.csv')
data_age_over_20 = data[data['age']>=20]
data_age_over_20['f1'] = data_age_over_20['f1'].fillna(data_age_over_20['f1'].mode()[0])
pt = power_transform(data_age_over_20[['f1']],  standardize=False)
pt_box = power_transform(data_age_over_20[['f1']], method = 'box-cox', standardize=False)

print(round(abs(pt-pt_box).sum(),2))

39.17

C:\Users\komsco\AppData\Local\Temp\ipykernel_21644\4038907393.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_age_over_20['f1'] = data_age_over_20['f1'].fillna(data_age_over_20['f1'].mode()[0])

9. 수치형 변수 변환하기 주어진 데이터에서 'f5'컬럼을 표준화(Standardization (Z-score Normalization))하고 그 중앙값을 구하시오
- 데이터셋 : basic1.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [48]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import StandardScaler

data = pd.read_csv('./basic1.csv')
sc = StandardScaler()
np.median(sc.fit_transform(data[['f5']]))

0.260619629559015

8. 주어진 데이터 셋에서 'f2' 컬럼이 1인 조건에 해당하는 데이터의 'f1'컬럼 누적합을 계산한다. 이때 발생하는 누적합 결측치는 바로 뒤의 값을 채우고, 누적합의 평균값을 출력한다. (단, 결측치 바로 뒤의 값이 없으면 다음에 나오는 값을 채워넣는다)¶

- 데이터셋 : basic1.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [57]:
import pandas as pd

data = pd.read_csv('./basic1.csv')
print(data[data['f2']==1]['f1'].cumsum().fillna(method = 'bfill').mean())

980.3783783783783

7. 'f4'컬럼의 값이 'ESFJ'인 데이터를 'ISFJ'로 대체하고, 'city'가 '경기'이면서 'f4'가 'ISFJ'인 데이터 중 'age'컬럼의 최대값을 출력하시오!
- 데이터셋 : basic1.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [68]:
import pandas as pd

data = pd.read_csv('./basic1.csv')
data['f4'].replace('ESFJ','ISFJ', inplace = True)
print(data[(data['city']=='경기') & (data['f4']=='ISFJ')]['age'].max())

90.0

6. 결측치 제거 및 그룹 합계에서 조건에 맞는 값 찾아 출력 주어진 데이터 중 basic1.csv에서 'f1'컬럼 결측 데이터를 제거하고, 'city'와 'f2'을 기준으로 묶어 합계를 구하고, 'city가 경기이면서 f2가 0'인 조건에 만족하는 f1 값을 구하시오
- 데이터셋 : basic1.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [74]:
import pandas as pd

data = pd.read_csv('./basic1.csv')
data_new = data.dropna(subset = 'f1')
data_new = data_new.groupby(['city', 'f2']).sum().reset_index()
print(data_new[(data_new['city']=='경기') & (data_new['f2']==0)]['f1'][0])

833.0

5. 조건에 맞는 데이터 표준편차 구하기 주어진 데이터 중 basic1.csv에서 'f4'컬럼 값이 'ENFJ'와 'INFP'인 'f1'의 표준편차 차이를 절대값으로 구하시오
- 데이터셋 : basic1.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [75]:
import pandas as pd

data = pd.read_csv('./basic1.csv')
print(abs(data[data['f4']=='ENFJ']['f1'].std() - data[data['f4']=='INFP']['f1'].std()))

5.859621525876811

4. 주어진 데이터 중 train.csv에서 'SalePrice'컬럼의 왜도와 첨도를 구한 값과, 'SalePrice'컬럼을 스케일링(log1p)로 변환한 이후 왜도와 첨도를 구해 모두 더한 다음 소수점 2째자리까지 출력하시오
- 데이터셋 : House Prices 
- Advanced Regression Technique (https://www.kaggle.com/c/house-prices-advanced-regression-techniques)
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [89]:
import pandas as pd
import numpy as np

data = pd.read_csv('./house-prices-advanced-regression-techniques/train.csv')
skews = data['SalePrice'].skew()
kurts = data['SalePrice'].kurt()

print('before skew', skews)
print('before kurt', kurts)

log_sc_sale_price = np.log1p(data['SalePrice'])
skwes_after = log_sc_sale_price.skew()
kurts_after = log_sc_sale_price.kurt()

print('after skew', skwes_after)
print('after_kurt', kurts_after)

print('sums :', round(skews+kurts+skwes_after+kurts_after,2))

before skew 1.8828757597682129
before kurt 6.536281860064529
after skew 0.12134661989685333
after_kurt 0.809519155707878
sums : 9.35

3. 결측치 처리 주어진 데이터에서 결측치가 80%이상 되는 컬럼은(변수는) 삭제하고, 80% 미만인 결측치가 있는 컬럼은 'city'별 중앙값으로 값을 대체하고 'f1'컬럼의 평균값을 출력하세요!
- 데이터셋 : basic1.csv 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작
- 강의 영상 : https://youtu.be/WqlpqBRn7x4

In [46]:
import pandas as pd

data = pd.read_csv('./basic1.csv')
data.isnull().sum()/len(data)>=0.8
del data['f3']

data_new = data.groupby(['city']).median().reset_index()
def extr(city):
    datas = data_new[data_new['city']==city]['f1'].values[0]
    
    return datas

seoul = extr('서울')
daegu = extr('대구')
busan = extr('부산')
gg = extr('경기')

data['f1'] = data['f1'].fillna(data['city'].map({
    '서울' : seoul,
    '대구' : daegu,
    '부산' : busan,
    '경기' : gg
}))

print(data['f1'].mean())

65.52

2. 주어진 데이터에서 이상치(소수점 나이)를 찾고 올림, 내림, 버림(절사)했을때 3가지 모두 이상치 'age' 평균을 구한 다음 모두 더하여 출력하시오¶
- 데이터셋 : basic1.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작
- 강의 영상 : https://youtu.be/c3Fr9G-ZYdw

In [56]:
import pandas as pd
import numpy as np

data = pd.read_csv('./basic1.csv')
outliers = data[(data['age']*10)%10!=0].reset_index(drop = True)


print(np.ceil(outliers['age']).mean() + np.floor(outliers['age'].mean()+ np.trunc(outliers['age'].mean())))

69.75

1. 데이터에서 IQR을 활용해 Fare컬럼의 이상치를 찾고, 이상치 데이터의 여성 수를 구하시오
- 강의 영상 : https://youtu.be/ipBW5D_UJEo
- 데이터셋 : titanic
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작
- 데이터 위치 "../input/titanic/train.csv" (copy&edit가 아닐 경우 별도로 데이터셋 불러와야 함)

In [69]:
import pandas as pd

data = pd.read_csv('./titanic/train.csv')
iqr = data['Fare'].quantile(0.75) - data['Fare'].quantile(0.25)

lower = data['Fare'].quantile(0.25) - iqr*1.5
upper = data['Fare'].quantile(0.75) + iqr*1.5

outlier_data = data[(data['Fare']<lower) | (data['Fare']>upper)]
print(outlier_data[outlier_data['Sex']=='female']['Sex'].count())

70